      * DATEUTIL - Date utility copybook
      *
       01 WS-DATE-UTILS.
           05 WS-CURRENT-DATE     PIC 9(8).
           05 WS-FORMATTED-DATE   PIC X(10).
           05 WS-JULIAN-DATE      PIC 9(7).
           05 WS-DAY-OF-WEEK      PIC 9.
               88 WS-SUNDAY       VALUE 1.
               88 WS-MONDAY       VALUE 2.
               88 WS-TUESDAY      VALUE 3.
               88 WS-WEDNESDAY    VALUE 4.
               88 WS-THURSDAY     VALUE 5.
               88 WS-FRIDAY       VALUE 6.
               88 WS-SATURDAY     VALUE 7.
